def start_quest():
    print("Ласкаво просимо в гру 'Дива'!")
    print("Ви стоїте перед таємничою печерою.")

    while True:
        print("\nОберіть дію:")
        print("1. Увійти в печеру 1")
        print("2. Піти далі 2")

        choice = input("Ваш вибір: ")

        if choice == "1":
            explore_cave()
        elif choice == "2":
            print("Вам не цікаві печери тому ви пішли далі.")    

def explore_cave():
    print("\nВи увійшли в печеру і побачили два тунелі.")
    print("Оберіть тунель:")
    print("1. Лівий тунель")
    print("2. Правий тунель")

    choice = input("Ваш вибір: ")

    if choice == "1":
        print("Ви вирушили в лівий тунель і знайшли скарб!")

    
    elif choice == "2":
           print("Ви обрали правий тунель і зустріли дівчину.")

    else:
                 print("Невірний вибір. Спробуйте ще раз.")
        
    print("\nЩо будите робити .")
    print("Оберіть дію:")
    print("1. Підійти")
    print("2. Втікти")
 
    choice = input("Ваш вибір: ")
 
    if choice == "1":
            print("Ви підійшли до дівчити, щоб зрозуміти що з нею. Підійшовши блище дівчина напала на вас!")
        # Тут можна додати інші події
    elif choice == "2":
        print("Вам стало страшно за своє життя тому ви втікли.")
        # Можна додати інші події
        
if __name__ == "__main__":
    start_quest()
